# 1. Python

# Coleta de dados de API

## API Heroku App - Pessoas

In [15]:
#pip install requests

Collecting requestsNote: you may need to restart the kernel to use updated packages.
  Using cached requests-2.25.0-py2.py3-none-any.whl (61 kB)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\marcio\anaconda3\envs\dev\lib\site-packages (from requests) (2020.12.5)
Collecting chardet<4,>=3.0.2
  Using cached chardet-3.0.4-py2.py3-none-any.whl (133 kB)
Collecting idna<3,>=2.5
  Using cached idna-2.10-py2.py3-none-any.whl (58 kB)
Collecting urllib3<1.27,>=1.21.1
  Using cached urllib3-1.26.2-py2.py3-none-any.whl (136 kB)
Installing collected packages: urllib3, idna, chardet, requests
Successfully installed chardet-3.0.4 idna-2.10 requests-2.25.0 urllib3-1.26.2

In [1]:
# Se as bibliocas não forem instaladas, fazer a instalação das mesmas
import json
import requests

In [2]:
response = requests.get("https://api-coleta-dados.herokuapp.com/api/pessoas")

In [4]:
print(response.status_code) #imprime o status da requisição

200

In [5]:
print(response.content) #imprime o conteúdo do retornado pela API

b'[{"nome":"Silvana Hadassa","idade":null,"data_nasc":"12/06/1964","sexo":"Feminino","signo":"G\xc3\xaameos","cidade":"Bras\xc3\xadlia","estado":"DF","altura":"1,67","peso":50,"tipo_sanguineo":"A+","cor":"vermelho"},{"nome":"Thales Kaique","idade":27,"data_nasc":"10/12/1993","sexo":"Masculino","signo":"Sagit\xc3\xa1rio","cidade":"Campo Grande","estado":"MS","altura":"1,63","peso":110,"tipo_sanguineo":"B+","cor":"laranja"},{"nome":"Henry Nathan","idade":29,"data_nasc":"21/09/1991","sexo":"Masculino","signo":"Virgem","cidade":"Macap\xc3\xa1","estado":"AP","altura":"1,86","peso":106,"tipo_sanguineo":"AB-","cor":"verde"},{"nome":"Lorenzo Vinicius","idade":64,"data_nasc":"22/10/1956","sexo":"Masculino","signo":"Libra","cidade":"Contagem","estado":"MG","altura":"1,87","peso":100,"tipo_sanguineo":"O+","cor":"vermelho"},{"nome":"Cau\xc3\xa3 Henrique","idade":50,"data_nasc":"09/03","sexo":"Masculino","signo":"Peixes","cidade":"Rondon\xc3\xb3polis","estado":"MT","altura":"1,74","peso":83,"tipo_sanguineo":"O-","cor":"vermelho"},{"nome":"Francisco Thomas","idade":19,"data_nasc":"12/04/2001","sexo":"Masculino","signo":"\xc3\x81ries","cidade":"Olinda","estado":"PE","altura":"1,91","peso":64,"tipo_sanguineo":"AB-","cor":"preto"},{"nome":"Bianca Fl\xc3\xa1via","idade":null,"data_nasc":"23/01/1949","sexo":"Feminino","signo":"Aqu\xc3\xa1rio","cidade":"Campo Grande","estado":"MS","altura":"1,54","peso":76,"tipo_sanguineo":"AB+","cor":"vermelho"},{"nome":"Arthur Filipe","idade":null,"data_nasc":"23/12/1987","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Rio Branco","estado":"AC","altura":"1,91","peso":54,"tipo_sanguineo":"AB-","cor":"roxo"},{"nome":"Teresinha Jaqueline","idade":null,"data_nasc":"20/10/1968","sexo":"Feminino","signo":"Libra","cidade":"Aragua\xc3\xadna","estado":"TO","altura":"1,84","peso":59,"tipo_sanguineo":"AB-","cor":"vermelho"},{"nome":"Manuel Lu\xc3\xads","idade":50,"data_nasc":"12/05/1970","sexo":"Masculino","signo":"Touro","cidade":"Manaus","estado":"AM","altura":"1,81","peso":85,"tipo_sanguineo":"A-","cor":"roxo"},{"nome":"Jorge Nicolas","idade":null,"data_nasc":"11/07/1968","sexo":"Masculino","signo":"C\xc3\xa2ncer","cidade":"Caruaru","estado":"PE","altura":"1,87","peso":54,"tipo_sanguineo":"AB-","cor":"roxo"},{"nome":"Ricardo Paulo","idade":37,"data_nasc":"16/12/1983","sexo":"Masculino","signo":"Sagit\xc3\xa1rio","cidade":"Porto Velho","estado":"RO","altura":"1,86","peso":52,"tipo_sanguineo":"B+","cor":"vermelho"},{"nome":"Gustavo Joaquim","idade":61,"data_nasc":"07/01/1959","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Macap\xc3\xa1","estado":"AP","altura":"1,62","peso":106,"tipo_sanguineo":"A+","cor":"verde"},{"nome":"Isabel Yasmin","idade":50,"data_nasc":"22/06/1970","sexo":"Feminino","signo":"C\xc3\xa2ncer","cidade":"Manaus","estado":"AM","altura":"1,64","peso":53,"tipo_sanguineo":"AB+","cor":"azul"},{"nome":"Daniel Lucca","idade":21,"data_nasc":"22/01","sexo":"Masculino","signo":"Aqu\xc3\xa1rio","cidade":"Planaltina","estado":"GO","altura":"1,84","peso":105,"tipo_sanguineo":"A+","cor":"verde"},{"nome":"Ben\xc3\xadcio Guilherme","idade":37,"data_nasc":"09/02/1983","sexo":"Masculino","signo":"Aqu\xc3\xa1rio","cidade":"Rondon\xc3\xb3polis","estado":"MT","altura":"1,63","peso":95,"tipo_sanguineo":"O-","cor":"laranja"},{"nome":"Jo\xc3\xa3o Pedro","idade":null,"data_nasc":"08/05/2002","sexo":"Masculino","signo":"Touro","cidade":"Santa Cruz do Sul","estado":"RS","altura":"1,95","peso":57,"tipo_sanguineo":"B-","cor":"preto"},{"nome":"Sandra Milena","idade":31,"data_nasc":"16/07/1989","sexo":"Feminino","signo":"C\xc3\xa2ncer","cidade":"Porto Alegre","estado":"RS","altura":"1,70","peso":84,"tipo_sanguineo":"AB-","cor":"verde"},{"nome":"Antonio S\xc3\xa9rgio","idade":49,"data_nasc":"15/04","sexo":"Masculino","signo":"\xc3\x81ries","cidade":"Carpina","estado":"PE","altura":"1,65","peso":71,"tipo_sanguineo":"O+","cor":"azul"},{"nome":"Arthur S\xc3\xa9rgio","idade":76,"data_nasc":"20/01/1944","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Boa Vista","estado":"RR","altura":"1,97","peso":51,"tipo_sanguineo":"AB-","cor":"preto"},{"nome":"Larissa Esther","idade":37,"data_nasc":"10/03/1983","sexo":"Feminino","signo":"Peixes","cidade":"Imperatriz","estado":"MA","altura":"1,68","peso":69,"tipo_sanguineo":"AB-","cor":"verde"},{"nome":"Thales Bento","idade":null,"data_nasc":"18/04/1942","sexo":"Masculino","signo":"\xc3\x81ries","cidade":"S\xc3\xa3o Lu\xc3\xads","estado":"MA","altura":"1,95","peso":64,"tipo_sanguineo":"A+","cor":"vermelho"},{"nome":"Breno Rafael","idade":58,"data_nasc":"09/01/1962","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Cacoal","estado":"RO","altura":"1,94","peso":108,"tipo_sanguineo":"A+","cor":"preto"},{"nome":"Tiago Gael","idade":24,"data_nasc":"17/07/1996","sexo":"Masculino","signo":"C\xc3\xa2ncer","cidade":"Cariacica","estado":"ES","altura":"1,68","peso":58,"tipo_sanguineo":"A+","cor":"azul"},{"nome":"Carolina M\xc3\xa1rcia","idade":null,"data_nasc":"25/11/1959","sexo":"Feminino","signo":"Sagit\xc3\xa1rio","cidade":"Parna\xc3\xadba","estado":"PI","altura":"1,50","peso":45,"tipo_sanguineo":"B-","cor":"preto"},{"nome":"Levi S\xc3\xa9rgio","idade":null,"data_nasc":"21/08/1949","sexo":"Masculino","signo":"Le\xc3\xa3o","cidade":"Santana","estado":"AP","altura":"1,83","peso":68,"tipo_sanguineo":"AB-","cor":"vermelho"},{"nome":"Juan Theo","idade":39,"data_nasc":"09/11/1981","sexo":"Masculino","signo":"Escorpi\xc3\xa3o","cidade":"Ponta Grossa","estado":"PR","altura":"1,67","peso":77,"tipo_sanguineo":"B-","cor":"verde"},{"nome":"Rafael Ryan","idade":70,"data_nasc":"10/01","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Arapiraca","estado":"AL","altura":"1,98","peso":85,"tipo_sanguineo":"O-","cor":"laranja"},{"nome":"Malu Emilly","idade":70,"data_nasc":"04/07/1950","sexo":"Feminino","signo":"C\xc3\xa2ncer","cidade":"\xc3\x81guas Lindas de Goi\xc3\xa1s","estado":"GO","altura":"1,62","peso":48,"tipo_sanguineo":"B-","cor":"vermelho"},{"nome":"Alice B\xc3\xa1rbara","idade":78,"data_nasc":"09/10/1942","sexo":"Feminino","signo":"Libra","cidade":"Cianorte","estado":"PR","altura":"1,78","peso":80,"tipo_sanguineo":"AB+","cor":"laranja"},{"nome":"Martin Edson","idade":35,"data_nasc":"15/01","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Aracaju","estado":"SE","altura":"1,60","peso":59,"tipo_sanguineo":"A-","cor":"laranja"},{"nome":"Danilo Jorge","idade":38,"data_nasc":"25/08/1982","sexo":"Masculino","signo":"Virgem","cidade":"Rondon\xc3\xb3polis","estado":"MT","altura":"1,79","peso":87,"tipo_sanguineo":"AB+","cor":"preto"},{"nome":"Isadora Sueli","idade":null,"data_nasc":"03/07/1999","sexo":"Feminino","signo":"C\xc3\xa2ncer","cidade":"Bel\xc3\xa9m","estado":"PA","altura":"1,59","peso":88,"tipo_sanguineo":"AB+","cor":"verde"},{"nome":"Maya Tatiane","idade":27,"data_nasc":"27/12/1993","sexo":"Feminino","signo":"Capric\xc3\xb3rnio","cidade":"Aracaju","estado":"SE","altura":"1,83","peso":89,"tipo_sanguineo":"AB-","cor":"roxo"},{"nome":"Bruno Manuel","idade":57,"data_nasc":"14/09","sexo":"Masculino","signo":"Virgem","cidade":"Jata\xc3\xad","estado":"GO","altura":"1,60","peso":92,"tipo_sanguineo":"O+","cor":"azul"},{"nome":"Gabriel Luan","idade":66,"data_nasc":"20/12/1954","sexo":"Masculino","signo":"Sagit\xc3\xa1rio","cidade":"Boa Vista","estado":"RR","altura":"1,71","peso":93,"tipo_sanguineo":"AB-","cor":"vermelho"},{"nome":"Henry Elias","idade":57,"data_nasc":"26/04/1963","sexo":"Masculino","signo":"Touro","cidade":"V\xc3\xa1rzea Grande","estado":"MT","altura":"1,83","peso":103,"tipo_sanguineo":"AB+","cor":"vermelho"},{"nome":"Marcela Laura","idade":56,"data_nasc":"17/11/1964","sexo":"Feminino","signo":"Escorpi\xc3\xa3o","cidade":"Macei\xc3\xb3","estado":"AL","altura":"1,52","peso":79,"tipo_sanguineo":"A-","cor":"verde"},{"nome":"Amanda Luna","idade":59,"data_nasc":"22/12/1961","sexo":"Feminino","signo":"Capric\xc3\xb3rnio","cidade":"Salvador","estado":"BA","altura":"1,67","peso":55,"tipo_sanguineo":"O-","cor":"amarelo"},{"nome":"Caio Ricardo","idade":null,"data_nasc":"07/09/1973","sexo":"Masculino","signo":"Virgem","cidade":"Boa Vista","estado":"RR","altura":"1,61","peso":97,"tipo_sanguineo":"A-","cor":"roxo"},{"nome":"Mariane Sabrina","idade":52,"data_nasc":"27/02/1968","sexo":"Feminino","signo":"Peixes","cidade":"Maca\xc3\xa9","estado":"RJ","altura":"1,67","peso":70,"tipo_sanguineo":"A+","cor":"vermelho"},{"nome":"Juliana Vanessa","idade":37,"data_nasc":"27/04/1983","sexo":"Feminino","signo":"Touro","cidade":"Manaus","estado":"AM","altura":"1,51","peso":67,"tipo_sanguineo":"AB-","cor":"roxo"},{"nome":"Milena Ros\xc3\xa2ngela","idade":null,"data_nasc":"11/02/1989","sexo":"Feminino","signo":"Aqu\xc3\xa1rio","cidade":"Macap\xc3\xa1","estado":"AP","altura":"1,58","peso":88,"tipo_sanguineo":"B+","cor":"azul"},{"nome":"Osvaldo Augusto","idade":41,"data_nasc":"15/04/1979","sexo":"Masculino","signo":"\xc3\x81ries","cidade":"Cuiab\xc3\xa1","estado":"MT","altura":"1,79","peso":107,"tipo_sanguineo":"A-","cor":"preto"},{"nome":"Nathan Igor","idade":57,"data_nasc":"17/10/1963","sexo":"Masculino","signo":"Libra","cidade":"Santa Luzia do Itanhy","estado":"SE","altura":"1,86","peso":91,"tipo_sanguineo":"B+","cor":"vermelho"},{"nome":"Let\xc3\xadcia Patr\xc3\xadcia","idade":76,"data_nasc":"07/11/1944","sexo":"Feminino","signo":"Escorpi\xc3\xa3o","cidade":"Jo\xc3\xa3o Pessoa","estado":"PB","altura":"1,62","peso":64,"tipo_sanguineo":"AB-","cor":"laranja"},{"nome":"Sophia Andrea","idade":35,"data_nasc":"23/07/1985","sexo":"Feminino","signo":"Le\xc3\xa3o","cidade":"Manaus","estado":"AM","altura":"1,63","peso":47,"tipo_sanguineo":"AB+","cor":"laranja"},{"nome":"Aurora L\xc3\xbacia","idade":72,"data_nasc":"19/01/1948","sexo":"Feminino","signo":"Capric\xc3\xb3rnio","cidade":"Parna\xc3\xadba","estado":"PI","altura":"1,57","peso":73,"tipo_sanguineo":"A-","cor":"amarelo"},{"nome":"Bruna Teresinha","idade":42,"data_nasc":"25/04/1978","sexo":"Feminino","signo":"Touro","cidade":"Brusque","estado":"SC","altura":"1,70","peso":77,"tipo_sanguineo":"A-","cor":"verde"},{"nome":"Erick Victor","idade":52,"data_nasc":"08/10","sexo":"Masculino","signo":"Libra","cidade":"Salvador","estado":"BA","altura":"1,68","peso":104,"tipo_sanguineo":"B-","cor":"laranja"},{"nome":"Gabrielly Stella","idade":39,"data_nasc":"16/10/1981","sexo":"Feminino","signo":"Libra","cidade":"Campo Grande","estado":"MS","altura":"1,77","peso":70,"tipo_sanguineo":"A-","cor":"amarelo"},{"nome":"Osvaldo Vitor","idade":46,"data_nasc":"06/05/1974","sexo":"Masculino","signo":"Touro","cidade":"Manaus","estado":"AM","altura":"1,67","peso":74,"tipo_sanguineo":"O-","cor":"vermelho"},{"nome":"Alana Kamilly","idade":33,"data_nasc":"12/01/1987","sexo":"Feminino","signo":"Capric\xc3\xb3rnio","cidade":"Boa Vista","estado":"RR","altura":"1,59","peso":88,"tipo_sanguineo":"B+","cor":"amarelo"},{"nome":"Bryan Kaique","idade":62,"data_nasc":"19/06/1958","sexo":"Masculino","signo":"G\xc3\xaameos","cidade":"Aracaju","estado":"SE","altura":"1,62","peso":110,"tipo_sanguineo":"B-","cor":"vermelho"},{"nome":"Benedito Renato","idade":33,"data_nasc":"08/10/1987","sexo":"Masculino","signo":"Libra","cidade":"Rio Grande","estado":"RS","altura":"1,88","peso":81,"tipo_sanguineo":"B-","cor":"laranja"},{"nome":"Kaique Isaac","idade":null,"data_nasc":"16/12/1971","sexo":"Masculino","signo":"Sagit\xc3\xa1rio","cidade":"Juazeiro do Norte","estado":"CE","altura":"1,89","peso":100,"tipo_sanguineo":"O+","cor":"preto"},{"nome":"Luiz Benjamin","idade":52,"data_nasc":"03/07/1968","sexo":"Masculino","signo":"C\xc3\xa2ncer","cidade":"Natal","estado":"RN","altura":"1,84","peso":77,"tipo_sanguineo":"AB-","cor":"verde"},{"nome":"F\xc3\xa1bio Roberto","idade":75,"data_nasc":"24/12","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Londrina","estado":"PR","altura":"2,00","peso":56,"tipo_sanguineo":"A+","cor":"amarelo"},{"nome":"Evelyn Julia","idade":null,"data_nasc":"18/01/1978","sexo":"Feminino","signo":"Capric\xc3\xb3rnio","cidade":"Aracaju","estado":"SE","altura":"1,79","peso":51,"tipo_sanguineo":"B+","cor":"vermelho"},{"nome":"Ot\xc3\xa1vio Cl\xc3\xa1udio","idade":null,"data_nasc":"04/01/1988","sexo":"Masculino","signo":"Capric\xc3\xb3rnio","cidade":"Imperatriz","estado":"MA","altura":"1,72","peso":99,"tipo_sanguineo":"AB+","cor":"azul"}]'

In [6]:
dados = json.loads(response.content) #serializa a resposta obtida
type(dados)

list

In [27]:
print(len(dados))

60

### Lista Pessoas

In [7]:
for pessoas in dados: #percorre o JSON 
    print(pessoas)

{'nome': 'Silvana Hadassa', 'idade': None, 'data_nasc': '12/06/1964', 'sexo': 'Feminino', 'signo': 'Gêmeos', 'cidade': 'Brasília', 'estado': 'DF', 'altura': '1,67', 'peso': 50, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
{'nome': 'Thales Kaique', 'idade': 27, 'data_nasc': '10/12/1993', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,63', 'peso': 110, 'tipo_sanguineo': 'B+', 'cor': 'laranja'}
{'nome': 'Henry Nathan', 'idade': 29, 'data_nasc': '21/09/1991', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,86', 'peso': 106, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
{'nome': 'Lorenzo Vinicius', 'idade': 64, 'data_nasc': '22/10/1956', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Contagem', 'estado': 'MG', 'altura': '1,87', 'peso': 100, 'tipo_sanguineo': 'O+', 'cor': 'vermelho'}
{'nome': 'Cauã Henrique', 'idade': 50, 'data_nasc': '09/03', 'sexo': 'Masculino', 'signo': 'Peixes', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,74', 'peso': 83, 'tipo_sanguineo': 'O-', 'cor': 'vermelho'}
{'nome': 'Francisco Thomas', 'idade': 19, 'data_nasc': '12/04/2001', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Olinda', 'estado': 'PE', 'altura': '1,91', 'peso': 64, 'tipo_sanguineo': 'AB-', 'cor': 'preto'}
{'nome': 'Bianca Flávia', 'idade': None, 'data_nasc': '23/01/1949', 'sexo': 'Feminino', 'signo': 'Aquário', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,54', 'peso': 76, 'tipo_sanguineo': 'AB+', 'cor': 'vermelho'}
{'nome': 'Arthur Filipe', 'idade': None, 'data_nasc': '23/12/1987', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Rio Branco', 'estado': 'AC', 'altura': '1,91', 'peso': 54, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
{'nome': 'Teresinha Jaqueline', 'idade': None, 'data_nasc': '20/10/1968', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Araguaína', 'estado': 'TO', 'altura': '1,84', 'peso': 59, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
{'nome': 'Manuel Luís', 'idade': 50, 'data_nasc': '12/05/1970', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,81', 'peso': 85, 'tipo_sanguineo': 'A-', 'cor': 'roxo'}
{'nome': 'Jorge Nicolas', 'idade': None, 'data_nasc': '11/07/1968', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Caruaru', 'estado': 'PE', 'altura': '1,87', 'peso': 54, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
{'nome': 'Ricardo Paulo', 'idade': 37, 'data_nasc': '16/12/1983', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Porto Velho', 'estado': 'RO', 'altura': '1,86', 'peso': 52, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
{'nome': 'Gustavo Joaquim', 'idade': 61, 'data_nasc': '07/01/1959', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,62', 'peso': 106, 'tipo_sanguineo': 'A+', 'cor': 'verde'}
{'nome': 'Isabel Yasmin', 'idade': 50, 'data_nasc': '22/06/1970', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,64', 'peso': 53, 'tipo_sanguineo': 'AB+', 'cor': 'azul'}
{'nome': 'Daniel Lucca', 'idade': 21, 'data_nasc': '22/01', 'sexo': 'Masculino', 'signo': 'Aquário', 'cidade': 'Planaltina', 'estado': 'GO', 'altura': '1,84', 'peso': 105, 'tipo_sanguineo': 'A+', 'cor': 'verde'}
{'nome': 'Benício Guilherme', 'idade': 37, 'data_nasc': '09/02/1983', 'sexo': 'Masculino', 'signo': 'Aquário', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,63', 'peso': 95, 'tipo_sanguineo': 'O-', 'cor': 'laranja'}
{'nome': 'João Pedro', 'idade': None, 'data_nasc': '08/05/2002', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Santa Cruz do Sul', 'estado': 'RS', 'altura': '1,95', 'peso': 57, 'tipo_sanguineo': 'B-', 'cor': 'preto'}
{'nome': 'Sandra Milena', 'idade': 31, 'data_nasc': '16/07/1989', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Porto Alegre', 'estado': 'RS', 'altura': '1,70', 'peso': 84, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
{'nome': 'Antonio Sérgio', 'idade': 49, 'data_nasc': '15/04', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Carpina', 'estado': 'PE', 'altura': '1,65', 'peso': 71, 'tipo_sanguineo': 'O+', 'cor': 'azul'}
{'nome': 'Arthur Sérgio', 'idade': 76, 'data_nasc': '20/01/1944', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,97', 'peso': 51, 'tipo_sanguineo': 'AB-', 'cor': 'preto'}
{'nome': 'Larissa Esther', 'idade': 37, 'data_nasc': '10/03/1983', 'sexo': 'Feminino', 'signo': 'Peixes', 'cidade': 'Imperatriz', 'estado': 'MA', 'altura': '1,68', 'peso': 69, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
{'nome': 'Thales Bento', 'idade': None, 'data_nasc': '18/04/1942', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'São Luís', 'estado': 'MA', 'altura': '1,95', 'peso': 64, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
{'nome': 'Breno Rafael', 'idade': 58, 'data_nasc': '09/01/1962', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Cacoal', 'estado': 'RO', 'altura': '1,94', 'peso': 108, 'tipo_sanguineo': 'A+', 'cor': 'preto'}
{'nome': 'Tiago Gael', 'idade': 24, 'data_nasc': '17/07/1996', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Cariacica', 'estado': 'ES', 'altura': '1,68', 'peso': 58, 'tipo_sanguineo': 'A+', 'cor': 'azul'}
{'nome': 'Carolina Márcia', 'idade': None, 'data_nasc': '25/11/1959', 'sexo': 'Feminino', 'signo': 'Sagitário', 'cidade': 'Parnaíba', 'estado': 'PI', 'altura': '1,50', 'peso': 45, 'tipo_sanguineo': 'B-', 'cor': 'preto'}
{'nome': 'Levi Sérgio', 'idade': None, 'data_nasc': '21/08/1949', 'sexo': 'Masculino', 'signo': 'Leão', 'cidade': 'Santana', 'estado': 'AP', 'altura': '1,83', 'peso': 68, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
{'nome': 'Juan Theo', 'idade': 39, 'data_nasc': '09/11/1981', 'sexo': 'Masculino', 'signo': 'Escorpião', 'cidade': 'Ponta Grossa', 'estado': 'PR', 'altura': '1,67', 'peso': 77, 'tipo_sanguineo': 'B-', 'cor': 'verde'}
{'nome': 'Rafael Ryan', 'idade': 70, 'data_nasc': '10/01', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Arapiraca', 'estado': 'AL', 'altura': '1,98', 'peso': 85, 'tipo_sanguineo': 'O-', 'cor': 'laranja'}
{'nome': 'Malu Emilly', 'idade': 70, 'data_nasc': '04/07/1950', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Águas Lindas de Goiás', 'estado': 'GO', 'altura': '1,62', 'peso': 48, 'tipo_sanguineo': 'B-', 'cor': 'vermelho'}
{'nome': 'Alice Bárbara', 'idade': 78, 'data_nasc': '09/10/1942', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Cianorte', 'estado': 'PR', 'altura': '1,78', 'peso': 80, 'tipo_sanguineo': 'AB+', 'cor': 'laranja'}
{'nome': 'Martin Edson', 'idade': 35, 'data_nasc': '15/01', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,60', 'peso': 59, 'tipo_sanguineo': 'A-', 'cor': 'laranja'}
{'nome': 'Danilo Jorge', 'idade': 38, 'data_nasc': '25/08/1982', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,79', 'peso': 87, 'tipo_sanguineo': 'AB+', 'cor': 'preto'}
{'nome': 'Isadora Sueli', 'idade': None, 'data_nasc': '03/07/1999', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Belém', 'estado': 'PA', 'altura': '1,59', 'peso': 88, 'tipo_sanguineo': 'AB+', 'cor': 'verde'}
{'nome': 'Maya Tatiane', 'idade': 27, 'data_nasc': '27/12/1993', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,83', 'peso': 89, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
{'nome': 'Bruno Manuel', 'idade': 57, 'data_nasc': '14/09', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Jataí', 'estado': 'GO', 'altura': '1,60', 'peso': 92, 'tipo_sanguineo': 'O+', 'cor': 'azul'}
{'nome': 'Gabriel Luan', 'idade': 66, 'data_nasc': '20/12/1954', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,71', 'peso': 93, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
{'nome': 'Henry Elias', 'idade': 57, 'data_nasc': '26/04/1963', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Várzea Grande', 'estado': 'MT', 'altura': '1,83', 'peso': 103, 'tipo_sanguineo': 'AB+', 'cor': 'vermelho'}
{'nome': 'Marcela Laura', 'idade': 56, 'data_nasc': '17/11/1964', 'sexo': 'Feminino', 'signo': 'Escorpião', 'cidade': 'Maceió', 'estado': 'AL', 'altura': '1,52', 'peso': 79, 'tipo_sanguineo': 'A-', 'cor': 'verde'}
{'nome': 'Amanda Luna', 'idade': 59, 'data_nasc': '22/12/1961', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Salvador', 'estado': 'BA', 'altura': '1,67', 'peso': 55, 'tipo_sanguineo': 'O-', 'cor': 'amarelo'}
{'nome': 'Caio Ricardo', 'idade': None, 'data_nasc': '07/09/1973', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,61', 'peso': 97, 'tipo_sanguineo': 'A-', 'cor': 'roxo'}
{'nome': 'Mariane Sabrina', 'idade': 52, 'data_nasc': '27/02/1968', 'sexo': 'Feminino', 'signo': 'Peixes', 'cidade': 'Macaé', 'estado': 'RJ', 'altura': '1,67', 'peso': 70, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
{'nome': 'Juliana Vanessa', 'idade': 37, 'data_nasc': '27/04/1983', 'sexo': 'Feminino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,51', 'peso': 67, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
{'nome': 'Milena Rosângela', 'idade': None, 'data_nasc': '11/02/1989', 'sexo': 'Feminino', 'signo': 'Aquário', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,58', 'peso': 88, 'tipo_sanguineo': 'B+', 'cor': 'azul'}
{'nome': 'Osvaldo Augusto', 'idade': 41, 'data_nasc': '15/04/1979', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Cuiabá', 'estado': 'MT', 'altura': '1,79', 'peso': 107, 'tipo_sanguineo': 'A-', 'cor': 'preto'}
{'nome': 'Nathan Igor', 'idade': 57, 'data_nasc': '17/10/1963', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Santa Luzia do Itanhy', 'estado': 'SE', 'altura': '1,86', 'peso': 91, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
{'nome': 'Letícia Patrícia', 'idade': 76, 'data_nasc': '07/11/1944', 'sexo': 'Feminino', 'signo': 'Escorpião', 'cidade': 'João Pessoa', 'estado': 'PB', 'altura': '1,62', 'peso': 64, 'tipo_sanguineo': 'AB-', 'cor': 'laranja'}
{'nome': 'Sophia Andrea', 'idade': 35, 'data_nasc': '23/07/1985', 'sexo': 'Feminino', 'signo': 'Leão', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,63', 'peso': 47, 'tipo_sanguineo': 'AB+', 'cor': 'laranja'}
{'nome': 'Aurora Lúcia', 'idade': 72, 'data_nasc': '19/01/1948', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Parnaíba', 'estado': 'PI', 'altura': '1,57', 'peso': 73, 'tipo_sanguineo': 'A-', 'cor': 'amarelo'}
{'nome': 'Bruna Teresinha', 'idade': 42, 'data_nasc': '25/04/1978', 'sexo': 'Feminino', 'signo': 'Touro', 'cidade': 'Brusque', 'estado': 'SC', 'altura': '1,70', 'peso': 77, 'tipo_sanguineo': 'A-', 'cor': 'verde'}
{'nome': 'Erick Victor', 'idade': 52, 'data_nasc': '08/10', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Salvador', 'estado': 'BA', 'altura': '1,68', 'peso': 104, 'tipo_sanguineo': 'B-', 'cor': 'laranja'}
{'nome': 'Gabrielly Stella', 'idade': 39, 'data_nasc': '16/10/1981', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,77', 'peso': 70, 'tipo_sanguineo': 'A-', 'cor': 'amarelo'}
{'nome': 'Osvaldo Vitor', 'idade': 46, 'data_nasc': '06/05/1974', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,67', 'peso': 74, 'tipo_sanguineo': 'O-', 'cor': 'vermelho'}
{'nome': 'Alana Kamilly', 'idade': 33, 'data_nasc': '12/01/1987', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,59', 'peso': 88, 'tipo_sanguineo': 'B+', 'cor': 'amarelo'}
{'nome': 'Bryan Kaique', 'idade': 62, 'data_nasc': '19/06/1958', 'sexo': 'Masculino', 'signo': 'Gêmeos', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,62', 'peso': 110, 'tipo_sanguineo': 'B-', 'cor': 'vermelho'}
{'nome': 'Benedito Renato', 'idade': 33, 'data_nasc': '08/10/1987', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Rio Grande', 'estado': 'RS', 'altura': '1,88', 'peso': 81, 'tipo_sanguineo': 'B-', 'cor': 'laranja'}
{'nome': 'Kaique Isaac', 'idade': None, 'data_nasc': '16/12/1971', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Juazeiro do Norte', 'estado': 'CE', 'altura': '1,89', 'peso': 100, 'tipo_sanguineo': 'O+', 'cor': 'preto'}
{'nome': 'Luiz Benjamin', 'idade': 52, 'data_nasc': '03/07/1968', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Natal', 'estado': 'RN', 'altura': '1,84', 'peso': 77, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
{'nome': 'Fábio Roberto', 'idade': 75, 'data_nasc': '24/12', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Londrina', 'estado': 'PR', 'altura': '2,00', 'peso': 56, 'tipo_sanguineo': 'A+', 'cor': 'amarelo'}
{'nome': 'Evelyn Julia', 'idade': None, 'data_nasc': '18/01/1978', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,79', 'peso': 51, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
{'nome': 'Otávio Cláudio', 'idade': None, 'data_nasc': '04/01/1988', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Imperatriz', 'estado': 'MA', 'altura': '1,72', 'peso': 99, 'tipo_sanguineo': 'AB+', 'cor': 'azul'}

In [46]:
print(dados[0])
pessoa = dados[0]
print(pessoa["nome"])

{'nome': 'Silvana Hadassa', 'idade': None, 'data_nasc': '12/06/1964', 'sexo': 'Feminino', 'signo': 'Gêmeos', 'cidade': 'Brasília', 'estado': 'DF', 'altura': '1,67', 'peso': 50, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
Silvana Hadassa

In [8]:
for pessoa in dados:
   print(pessoa["estado"])

DF
MS
AP
MG
MT
PE
MS
AC
TO
AM
PE
RO
AP
AM
GO
MT
RS
RS
PE
RR
MA
MA
RO
ES
PI
AP
PR
AL
GO
PR
SE
MT
PA
SE
GO
RR
MT
AL
BA
RR
RJ
AM
AP
MT
SE
PB
AM
PI
SC
BA
MS
AM
RR
SE
RS
CE
RN
PR
SE
MA

# Coleta os dados para armazenar no Mysql

In [9]:
import mysql.connector

In [10]:
mydb = mysql.connector.connect(
    host='localhost',
    user='root',
    password='igti',
    database='db_desafio'
)

print(mydb)

mycursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000000005CFA5B0>

In [11]:
mycursor.execute("SHOW TABLES")

for tb in mycursor:
    print(tb)

('tb_cidade',)
('tb_cor',)
('tb_estado',)
('tb_pessoa',)
('tb_tiposanguineo',)

#### Grava Estados

In [63]:
for pessoa in dados:
   #print(pessoa['estado'])

   query = "INSERT INTO db_desafio.tb_estado (sigla) SELECT * FROM (SELECT '%s') AS tmp " % pessoa["estado"]
   query += "WHERE NOT EXISTS (SELECT sigla FROM db_desafio.tb_estado WHERE sigla = '%s')"  % pessoa["estado"]

   #print(query)
   mycursor.execute(query)

   #Fazer a confirmação da inserção
   mydb.commit()

DF
MS
AP
MG
MT
PE
MS
AC
TO
AM
PE
RO
AP
AM
GO
MT
RS
RS
PE
RR
MA
MA
RO
ES
PI
AP
PR
AL
GO
PR
SE
MT
PA
SE
GO
RR
MT
AL
BA
RR
RJ
AM
AP
MT
SE
PB
AM
PI
SC
BA
MS
AM
RR
SE
RS
CE
RN
PR
SE
MA
0 registro(s) inserido(s).

#### Grava Cor

In [68]:
for pessoa in dados:
   #print(pessoa['cor'])

   query = "INSERT INTO db_desafio.tb_cor (cor) SELECT * FROM (SELECT '%s') AS tmp " % pessoa["cor"]
   query += "WHERE NOT EXISTS (SELECT cor FROM db_desafio.tb_cor WHERE cor = '%s')"  % pessoa["cor"]

   #print(query)
   mycursor.execute(query)

   #Fazer a confirmação da inserção
   mydb.commit()

vermelho
laranja
verde
vermelho
vermelho
preto
vermelho
roxo
vermelho
roxo
roxo
vermelho
verde
azul
verde
laranja
preto
verde
azul
preto
verde
vermelho
preto
azul
preto
vermelho
verde
laranja
vermelho
laranja
laranja
preto
verde
roxo
azul
vermelho
vermelho
verde
amarelo
roxo
vermelho
roxo
azul
preto
vermelho
laranja
laranja
amarelo
verde
laranja
amarelo
vermelho
amarelo
vermelho
laranja
preto
verde
amarelo
vermelho
azul

In [69]:
#### Grava Tipo sanguìneo

In [73]:
for pessoa in dados:
   print(pessoa['tipo_sanguineo'])

   query = "INSERT INTO db_desafio.tb_tiposanguineo (tipo) SELECT * FROM (SELECT '%s') AS tmp " % pessoa["tipo_sanguineo"]
   query += "WHERE NOT EXISTS (SELECT tipo FROM db_desafio.tb_tiposanguineo WHERE tipo = '%s')"  % pessoa["tipo_sanguineo"]

   #print(query)
   mycursor.execute(query)

   #Fazer a confirmação da inserção
   mydb.commit()

A+
B+
AB-
O+
O-
AB-
AB+
AB-
AB-
A-
AB-
B+
A+
AB+
A+
O-
B-
AB-
O+
AB-
AB-
A+
A+
A+
B-
AB-
B-
O-
B-
AB+
A-
AB+
AB+
AB-
O+
AB-
AB+
A-
O-
A-
A+
AB-
B+
A-
B+
AB-
AB+
A-
A-
B-
A-
O-
B+
B-
B-
O+
AB-
A+
B+
AB+

In [74]:
mydb.close() #Fechar o banco de dados

#### Grava Cidades

In [31]:
for pessoa in dados:
   #print(pessoa['estado'] + ' ' + pessoa['cidade'])
 
   query = "INSERT INTO tb_cidade(nome, id_estado) "
   query += "SELECT * FROM (SELECT '%s', (SELECT id_estado FROM tb_estado WHERE sigla = '%s')) AS tmp " % (pessoa['cidade'], pessoa['estado'])
   query += "WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = '%s')"  % pessoa['cidade']

   print(query)
   mycursor.execute(query)

   #Fazer a confirmação da inserção    
   mydb.commit()

INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Brasília', (SELECT id_estado FROM tb_estado WHERE sigla = 'DF')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Brasília')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Campo Grande', (SELECT id_estado FROM tb_estado WHERE sigla = 'MS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Campo Grande')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Macapá', (SELECT id_estado FROM tb_estado WHERE sigla = 'AP')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Macapá')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Contagem', (SELECT id_estado FROM tb_estado WHERE sigla = 'MG')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Contagem')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Rondonópolis', (SELECT id_estado FROM tb_estado WHERE sigla = 'MT')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Rondonópolis')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Olinda', (SELECT id_estado FROM tb_estado WHERE sigla = 'PE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Olinda')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Campo Grande', (SELECT id_estado FROM tb_estado WHERE sigla = 'MS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Campo Grande')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Rio Branco', (SELECT id_estado FROM tb_estado WHERE sigla = 'AC')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Rio Branco')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Araguaína', (SELECT id_estado FROM tb_estado WHERE sigla = 'TO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Araguaína')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Manaus', (SELECT id_estado FROM tb_estado WHERE sigla = 'AM')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Manaus')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Caruaru', (SELECT id_estado FROM tb_estado WHERE sigla = 'PE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Caruaru')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Porto Velho', (SELECT id_estado FROM tb_estado WHERE sigla = 'RO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Porto Velho')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Macapá', (SELECT id_estado FROM tb_estado WHERE sigla = 'AP')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Macapá')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Manaus', (SELECT id_estado FROM tb_estado WHERE sigla = 'AM')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Manaus')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Planaltina', (SELECT id_estado FROM tb_estado WHERE sigla = 'GO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Planaltina')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Rondonópolis', (SELECT id_estado FROM tb_estado WHERE sigla = 'MT')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Rondonópolis')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Santa Cruz do Sul', (SELECT id_estado FROM tb_estado WHERE sigla = 'RS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Santa Cruz do Sul')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Porto Alegre', (SELECT id_estado FROM tb_estado WHERE sigla = 'RS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Porto Alegre')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Carpina', (SELECT id_estado FROM tb_estado WHERE sigla = 'PE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Carpina')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Boa Vista', (SELECT id_estado FROM tb_estado WHERE sigla = 'RR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Boa Vista')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Imperatriz', (SELECT id_estado FROM tb_estado WHERE sigla = 'MA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Imperatriz')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'São Luís', (SELECT id_estado FROM tb_estado WHERE sigla = 'MA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'São Luís')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Cacoal', (SELECT id_estado FROM tb_estado WHERE sigla = 'RO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Cacoal')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Cariacica', (SELECT id_estado FROM tb_estado WHERE sigla = 'ES')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Cariacica')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Parnaíba', (SELECT id_estado FROM tb_estado WHERE sigla = 'PI')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Parnaíba')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Santana', (SELECT id_estado FROM tb_estado WHERE sigla = 'AP')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Santana')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Ponta Grossa', (SELECT id_estado FROM tb_estado WHERE sigla = 'PR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Ponta Grossa')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Arapiraca', (SELECT id_estado FROM tb_estado WHERE sigla = 'AL')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Arapiraca')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Águas Lindas de Goiás', (SELECT id_estado FROM tb_estado WHERE sigla = 'GO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Águas Lindas de Goiás')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Cianorte', (SELECT id_estado FROM tb_estado WHERE sigla = 'PR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Cianorte')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Aracaju', (SELECT id_estado FROM tb_estado WHERE sigla = 'SE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Aracaju')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Rondonópolis', (SELECT id_estado FROM tb_estado WHERE sigla = 'MT')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Rondonópolis')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Belém', (SELECT id_estado FROM tb_estado WHERE sigla = 'PA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Belém')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Aracaju', (SELECT id_estado FROM tb_estado WHERE sigla = 'SE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Aracaju')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Jataí', (SELECT id_estado FROM tb_estado WHERE sigla = 'GO')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Jataí')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Boa Vista', (SELECT id_estado FROM tb_estado WHERE sigla = 'RR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Boa Vista')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Várzea Grande', (SELECT id_estado FROM tb_estado WHERE sigla = 'MT')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Várzea Grande')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Maceió', (SELECT id_estado FROM tb_estado WHERE sigla = 'AL')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Maceió')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Salvador', (SELECT id_estado FROM tb_estado WHERE sigla = 'BA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Salvador')

INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Boa Vista', (SELECT id_estado FROM tb_estado WHERE sigla = 'RR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Boa Vista')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Macaé', (SELECT id_estado FROM tb_estado WHERE sigla = 'RJ')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Macaé')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Manaus', (SELECT id_estado FROM tb_estado WHERE sigla = 'AM')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Manaus')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Macapá', (SELECT id_estado FROM tb_estado WHERE sigla = 'AP')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Macapá')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Cuiabá', (SELECT id_estado FROM tb_estado WHERE sigla = 'MT')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Cuiabá')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Santa Luzia do Itanhy', (SELECT id_estado FROM tb_estado WHERE sigla = 'SE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Santa Luzia do Itanhy')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'João Pessoa', (SELECT id_estado FROM tb_estado WHERE sigla = 'PB')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'João Pessoa')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Manaus', (SELECT id_estado FROM tb_estado WHERE sigla = 'AM')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Manaus')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Parnaíba', (SELECT id_estado FROM tb_estado WHERE sigla = 'PI')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Parnaíba')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Brusque', (SELECT id_estado FROM tb_estado WHERE sigla = 'SC')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Brusque')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Salvador', (SELECT id_estado FROM tb_estado WHERE sigla = 'BA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Salvador')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Campo Grande', (SELECT id_estado FROM tb_estado WHERE sigla = 'MS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Campo Grande')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Manaus', (SELECT id_estado FROM tb_estado WHERE sigla = 'AM')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Manaus')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Boa Vista', (SELECT id_estado FROM tb_estado WHERE sigla = 'RR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Boa Vista')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Aracaju', (SELECT id_estado FROM tb_estado WHERE sigla = 'SE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Aracaju')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Rio Grande', (SELECT id_estado FROM tb_estado WHERE sigla = 'RS')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Rio Grande')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Juazeiro do Norte', (SELECT id_estado FROM tb_estado WHERE sigla = 'CE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Juazeiro do Norte')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Natal', (SELECT id_estado FROM tb_estado WHERE sigla = 'RN')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Natal')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Londrina', (SELECT id_estado FROM tb_estado WHERE sigla = 'PR')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Londrina')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Aracaju', (SELECT id_estado FROM tb_estado WHERE sigla = 'SE')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Aracaju')
INSERT INTO tb_cidade(nome, id_estado) SELECT * FROM (SELECT 'Imperatriz', (SELECT id_estado FROM tb_estado WHERE sigla = 'MA')) AS tmp WHERE NOT EXISTS (SELECT nome FROM db_desafio.tb_cidade WHERE nome = 'Imperatriz')

#### Grava Pessoas

In [61]:
from datetime import datetime
from dateutil.relativedelta import *

In [96]:
for pessoa in dados:
   print(pessoa)

   if pessoa['idade']  == None:
      agora = datetime.today()
      data_nasc = datetime.strptime(pessoa['data_nasc'], '%d/%m/%Y')    
      diff =  relativedelta(agora,data_nasc)
      idade = diff.years
   elif len(pessoa['data_nasc']) == 5:
      agora = datetime.today()
      data_str = pessoa['data_nasc'] + '/' + str(agora.year)  
      data_aux =  datetime.strptime(data_str, '%d/%m/%Y')  
      ano = agora.year - pessoa['idade']
      if data_aux > agora:
         print(str(ano)) 
         ano -= 1 
         print(str(ano))        
      data_str = pessoa['data_nasc'] + '/' + str(ano)
      data_nasc = datetime.strptime(data_str, '%d/%m/%Y')
      idade = pessoa['idade']
   else:
      data_nasc = datetime.strptime(pessoa['data_nasc'], '%d/%m/%Y')
      idade = pessoa['idade']
    
   altura = float(pessoa['altura'].replace(',','.')) 

   sexo = pessoa['sexo'][0]
   #print(str(idade))  
   #print(data_nasc)
    
   query = "INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) " 
   query += "VALUES('%s', %s, '%s', '%s', '%s', %s, %s, \
               (SELECT id_cidade FROM tb_cidade WHERE nome = '%s'), \
               (SELECT id_cor FROM tb_cor WHERE cor = '%s'), \
               (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = '%s')) " % (pessoa['nome'], idade, data_nasc, sexo, pessoa['signo'], altura, pessoa['peso'], pessoa['cidade'], pessoa['cor'], pessoa['tipo_sanguineo'])
   
   print(query)
   mycursor.execute(query)

   #Fazer a confirmação da inserção    
   mydb.commit()

{'nome': 'Silvana Hadassa', 'idade': None, 'data_nasc': '12/06/1964', 'sexo': 'Feminino', 'signo': 'Gêmeos', 'cidade': 'Brasília', 'estado': 'DF', 'altura': '1,67', 'peso': 50, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Silvana Hadassa', 56, '1964-06-12 00:00:00', 'F', 'Gêmeos', 1.67, 50,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Brasília'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Thales Kaique', 'idade': 27, 'data_nasc': '10/12/1993', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,63', 'peso': 110, 'tipo_sanguineo': 'B+', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Thales Kaique', 27, '1993-12-10 00:00:00', 'M', 'Sagitário', 1.63, 110,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Campo Grande'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))
{'nome': 'Henry Nathan', 'idade': 29, 'data_nasc': '21/09/1991', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,86', 'peso': 106, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Henry Nathan', 29, '1991-09-21 00:00:00', 'M', 'Virgem', 1.86, 106,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Macapá'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Lorenzo Vinicius', 'idade': 64, 'data_nasc': '22/10/1956', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Contagem', 'estado': 'MG', 'altura': '1,87', 'peso': 100, 'tipo_sanguineo': 'O+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Lorenzo Vinicius', 64, '1956-10-22 00:00:00', 'M', 'Libra', 1.87, 100,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Contagem'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O+'))
{'nome': 'Cauã Henrique', 'idade': 50, 'data_nasc': '09/03', 'sexo': 'Masculino', 'signo': 'Peixes', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,74', 'peso': 83, 'tipo_sanguineo': 'O-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Cauã Henrique', 50, '1970-03-09 00:00:00', 'M', 'Peixes', 1.74, 83,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Rondonópolis'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O-'))
{'nome': 'Francisco Thomas', 'idade': 19, 'data_nasc': '12/04/2001', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Olinda', 'estado': 'PE', 'altura': '1,91', 'peso': 64, 'tipo_sanguineo': 'AB-', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Francisco Thomas', 19, '2001-04-12 00:00:00', 'M', 'Áries', 1.91, 64,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Olinda'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Bianca Flávia', 'idade': None, 'data_nasc': '23/01/1949', 'sexo': 'Feminino', 'signo': 'Aquário', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,54', 'peso': 76, 'tipo_sanguineo': 'AB+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Bianca Flávia', 71, '1949-01-23 00:00:00', 'F', 'Aquário', 1.54, 76,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Campo Grande'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Arthur Filipe', 'idade': None, 'data_nasc': '23/12/1987', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Rio Branco', 'estado': 'AC', 'altura': '1,91', 'peso': 54, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Arthur Filipe', 32, '1987-12-23 00:00:00', 'M', 'Capricórnio', 1.91, 54,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Rio Branco'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Teresinha Jaqueline', 'idade': None, 'data_nasc': '20/10/1968', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Araguaína', 'estado': 'TO', 'altura': '1,84', 'peso': 59, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Teresinha Jaqueline', 52, '1968-10-20 00:00:00', 'F', 'Libra', 1.84, 59,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Araguaína'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Manuel Luís', 'idade': 50, 'data_nasc': '12/05/1970', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,81', 'peso': 85, 'tipo_sanguineo': 'A-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Manuel Luís', 50, '1970-05-12 00:00:00', 'M', 'Touro', 1.81, 85,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Manaus'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Jorge Nicolas', 'idade': None, 'data_nasc': '11/07/1968', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Caruaru', 'estado': 'PE', 'altura': '1,87', 'peso': 54, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Jorge Nicolas', 52, '1968-07-11 00:00:00', 'M', 'Câncer', 1.87, 54,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Caruaru'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Ricardo Paulo', 'idade': 37, 'data_nasc': '16/12/1983', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Porto Velho', 'estado': 'RO', 'altura': '1,86', 'peso': 52, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Ricardo Paulo', 37, '1983-12-16 00:00:00', 'M', 'Sagitário', 1.86, 52,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Porto Velho'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))
{'nome': 'Gustavo Joaquim', 'idade': 61, 'data_nasc': '07/01/1959', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,62', 'peso': 106, 'tipo_sanguineo': 'A+', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Gustavo Joaquim', 61, '1959-01-07 00:00:00', 'M', 'Capricórnio', 1.62, 106,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Macapá'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Isabel Yasmin', 'idade': 50, 'data_nasc': '22/06/1970', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,64', 'peso': 53, 'tipo_sanguineo': 'AB+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Isabel Yasmin', 50, '1970-06-22 00:00:00', 'F', 'Câncer', 1.64, 53,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Manaus'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Daniel Lucca', 'idade': 21, 'data_nasc': '22/01', 'sexo': 'Masculino', 'signo': 'Aquário', 'cidade': 'Planaltina', 'estado': 'GO', 'altura': '1,84', 'peso': 105, 'tipo_sanguineo': 'A+', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Daniel Lucca', 21, '1999-01-22 00:00:00', 'M', 'Aquário', 1.84, 105,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Planaltina'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))

{'nome': 'Benício Guilherme', 'idade': 37, 'data_nasc': '09/02/1983', 'sexo': 'Masculino', 'signo': 'Aquário', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,63', 'peso': 95, 'tipo_sanguineo': 'O-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Benício Guilherme', 37, '1983-02-09 00:00:00', 'M', 'Aquário', 1.63, 95,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Rondonópolis'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O-'))
{'nome': 'João Pedro', 'idade': None, 'data_nasc': '08/05/2002', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Santa Cruz do Sul', 'estado': 'RS', 'altura': '1,95', 'peso': 57, 'tipo_sanguineo': 'B-', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('João Pedro', 18, '2002-05-08 00:00:00', 'M', 'Touro', 1.95, 57,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Santa Cruz do Sul'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Sandra Milena', 'idade': 31, 'data_nasc': '16/07/1989', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Porto Alegre', 'estado': 'RS', 'altura': '1,70', 'peso': 84, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Sandra Milena', 31, '1989-07-16 00:00:00', 'F', 'Câncer', 1.7, 84,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Porto Alegre'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Antonio Sérgio', 'idade': 49, 'data_nasc': '15/04', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Carpina', 'estado': 'PE', 'altura': '1,65', 'peso': 71, 'tipo_sanguineo': 'O+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Antonio Sérgio', 49, '1971-04-15 00:00:00', 'M', 'Áries', 1.65, 71,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Carpina'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O+'))
{'nome': 'Arthur Sérgio', 'idade': 76, 'data_nasc': '20/01/1944', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,97', 'peso': 51, 'tipo_sanguineo': 'AB-', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Arthur Sérgio', 76, '1944-01-20 00:00:00', 'M', 'Capricórnio', 1.97, 51,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Boa Vista'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Larissa Esther', 'idade': 37, 'data_nasc': '10/03/1983', 'sexo': 'Feminino', 'signo': 'Peixes', 'cidade': 'Imperatriz', 'estado': 'MA', 'altura': '1,68', 'peso': 69, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Larissa Esther', 37, '1983-03-10 00:00:00', 'F', 'Peixes', 1.68, 69,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Imperatriz'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Thales Bento', 'idade': None, 'data_nasc': '18/04/1942', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'São Luís', 'estado': 'MA', 'altura': '1,95', 'peso': 64, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Thales Bento', 78, '1942-04-18 00:00:00', 'M', 'Áries', 1.95, 64,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'São Luís'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Breno Rafael', 'idade': 58, 'data_nasc': '09/01/1962', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Cacoal', 'estado': 'RO', 'altura': '1,94', 'peso': 108, 'tipo_sanguineo': 'A+', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Breno Rafael', 58, '1962-01-09 00:00:00', 'M', 'Capricórnio', 1.94, 108,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Cacoal'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Tiago Gael', 'idade': 24, 'data_nasc': '17/07/1996', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Cariacica', 'estado': 'ES', 'altura': '1,68', 'peso': 58, 'tipo_sanguineo': 'A+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Tiago Gael', 24, '1996-07-17 00:00:00', 'M', 'Câncer', 1.68, 58,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Cariacica'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Carolina Márcia', 'idade': None, 'data_nasc': '25/11/1959', 'sexo': 'Feminino', 'signo': 'Sagitário', 'cidade': 'Parnaíba', 'estado': 'PI', 'altura': '1,50', 'peso': 45, 'tipo_sanguineo': 'B-', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Carolina Márcia', 61, '1959-11-25 00:00:00', 'F', 'Sagitário', 1.5, 45,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Parnaíba'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Levi Sérgio', 'idade': None, 'data_nasc': '21/08/1949', 'sexo': 'Masculino', 'signo': 'Leão', 'cidade': 'Santana', 'estado': 'AP', 'altura': '1,83', 'peso': 68, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Levi Sérgio', 71, '1949-08-21 00:00:00', 'M', 'Leão', 1.83, 68,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Santana'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Juan Theo', 'idade': 39, 'data_nasc': '09/11/1981', 'sexo': 'Masculino', 'signo': 'Escorpião', 'cidade': 'Ponta Grossa', 'estado': 'PR', 'altura': '1,67', 'peso': 77, 'tipo_sanguineo': 'B-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Juan Theo', 39, '1981-11-09 00:00:00', 'M', 'Escorpião', 1.67, 77,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Ponta Grossa'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Rafael Ryan', 'idade': 70, 'data_nasc': '10/01', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Arapiraca', 'estado': 'AL', 'altura': '1,98', 'peso': 85, 'tipo_sanguineo': 'O-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Rafael Ryan', 70, '1950-01-10 00:00:00', 'M', 'Capricórnio', 1.98, 85,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Arapiraca'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O-'))
{'nome': 'Malu Emilly', 'idade': 70, 'data_nasc': '04/07/1950', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Águas Lindas de Goiás', 'estado': 'GO', 'altura': '1,62', 'peso': 48, 'tipo_sanguineo': 'B-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Malu Emilly', 70, '1950-07-04 00:00:00', 'F', 'Câncer', 1.62, 48,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Águas Lindas de Goiás'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))

{'nome': 'Alice Bárbara', 'idade': 78, 'data_nasc': '09/10/1942', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Cianorte', 'estado': 'PR', 'altura': '1,78', 'peso': 80, 'tipo_sanguineo': 'AB+', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Alice Bárbara', 78, '1942-10-09 00:00:00', 'F', 'Libra', 1.78, 80,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Cianorte'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Martin Edson', 'idade': 35, 'data_nasc': '15/01', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,60', 'peso': 59, 'tipo_sanguineo': 'A-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Martin Edson', 35, '1985-01-15 00:00:00', 'M', 'Capricórnio', 1.6, 59,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Aracaju'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Danilo Jorge', 'idade': 38, 'data_nasc': '25/08/1982', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Rondonópolis', 'estado': 'MT', 'altura': '1,79', 'peso': 87, 'tipo_sanguineo': 'AB+', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Danilo Jorge', 38, '1982-08-25 00:00:00', 'M', 'Virgem', 1.79, 87,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Rondonópolis'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Isadora Sueli', 'idade': None, 'data_nasc': '03/07/1999', 'sexo': 'Feminino', 'signo': 'Câncer', 'cidade': 'Belém', 'estado': 'PA', 'altura': '1,59', 'peso': 88, 'tipo_sanguineo': 'AB+', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Isadora Sueli', 21, '1999-07-03 00:00:00', 'F', 'Câncer', 1.59, 88,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Belém'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Maya Tatiane', 'idade': 27, 'data_nasc': '27/12/1993', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,83', 'peso': 89, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Maya Tatiane', 27, '1993-12-27 00:00:00', 'F', 'Capricórnio', 1.83, 89,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Aracaju'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Bruno Manuel', 'idade': 57, 'data_nasc': '14/09', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Jataí', 'estado': 'GO', 'altura': '1,60', 'peso': 92, 'tipo_sanguineo': 'O+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Bruno Manuel', 57, '1963-09-14 00:00:00', 'M', 'Virgem', 1.6, 92,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Jataí'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O+'))
{'nome': 'Gabriel Luan', 'idade': 66, 'data_nasc': '20/12/1954', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,71', 'peso': 93, 'tipo_sanguineo': 'AB-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Gabriel Luan', 66, '1954-12-20 00:00:00', 'M', 'Sagitário', 1.71, 93,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Boa Vista'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Henry Elias', 'idade': 57, 'data_nasc': '26/04/1963', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Várzea Grande', 'estado': 'MT', 'altura': '1,83', 'peso': 103, 'tipo_sanguineo': 'AB+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Henry Elias', 57, '1963-04-26 00:00:00', 'M', 'Touro', 1.83, 103,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Várzea Grande'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Marcela Laura', 'idade': 56, 'data_nasc': '17/11/1964', 'sexo': 'Feminino', 'signo': 'Escorpião', 'cidade': 'Maceió', 'estado': 'AL', 'altura': '1,52', 'peso': 79, 'tipo_sanguineo': 'A-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Marcela Laura', 56, '1964-11-17 00:00:00', 'F', 'Escorpião', 1.52, 79,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Maceió'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Amanda Luna', 'idade': 59, 'data_nasc': '22/12/1961', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Salvador', 'estado': 'BA', 'altura': '1,67', 'peso': 55, 'tipo_sanguineo': 'O-', 'cor': 'amarelo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Amanda Luna', 59, '1961-12-22 00:00:00', 'F', 'Capricórnio', 1.67, 55,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Salvador'),                (SELECT id_cor FROM tb_cor WHERE cor = 'amarelo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O-'))
{'nome': 'Caio Ricardo', 'idade': None, 'data_nasc': '07/09/1973', 'sexo': 'Masculino', 'signo': 'Virgem', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,61', 'peso': 97, 'tipo_sanguineo': 'A-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Caio Ricardo', 47, '1973-09-07 00:00:00', 'M', 'Virgem', 1.61, 97,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Boa Vista'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Mariane Sabrina', 'idade': 52, 'data_nasc': '27/02/1968', 'sexo': 'Feminino', 'signo': 'Peixes', 'cidade': 'Macaé', 'estado': 'RJ', 'altura': '1,67', 'peso': 70, 'tipo_sanguineo': 'A+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Mariane Sabrina', 52, '1968-02-27 00:00:00', 'F', 'Peixes', 1.67, 70,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Macaé'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))
{'nome': 'Juliana Vanessa', 'idade': 37, 'data_nasc': '27/04/1983', 'sexo': 'Feminino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,51', 'peso': 67, 'tipo_sanguineo': 'AB-', 'cor': 'roxo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Juliana Vanessa', 37, '1983-04-27 00:00:00', 'F', 'Touro', 1.51, 67,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Manaus'),                (SELECT id_cor FROM tb_cor WHERE cor = 'roxo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Milena Rosângela', 'idade': None, 'data_nasc': '11/02/1989', 'sexo': 'Feminino', 'signo': 'Aquário', 'cidade': 'Macapá', 'estado': 'AP', 'altura': '1,58', 'peso': 88, 'tipo_sanguineo': 'B+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Milena Rosângela', 31, '1989-02-11 00:00:00', 'F', 'Aquário', 1.58, 88,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Macapá'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))

{'nome': 'Osvaldo Augusto', 'idade': 41, 'data_nasc': '15/04/1979', 'sexo': 'Masculino', 'signo': 'Áries', 'cidade': 'Cuiabá', 'estado': 'MT', 'altura': '1,79', 'peso': 107, 'tipo_sanguineo': 'A-', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Osvaldo Augusto', 41, '1979-04-15 00:00:00', 'M', 'Áries', 1.79, 107,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Cuiabá'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Nathan Igor', 'idade': 57, 'data_nasc': '17/10/1963', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Santa Luzia do Itanhy', 'estado': 'SE', 'altura': '1,86', 'peso': 91, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Nathan Igor', 57, '1963-10-17 00:00:00', 'M', 'Libra', 1.86, 91,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Santa Luzia do Itanhy'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))
{'nome': 'Letícia Patrícia', 'idade': 76, 'data_nasc': '07/11/1944', 'sexo': 'Feminino', 'signo': 'Escorpião', 'cidade': 'João Pessoa', 'estado': 'PB', 'altura': '1,62', 'peso': 64, 'tipo_sanguineo': 'AB-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Letícia Patrícia', 76, '1944-11-07 00:00:00', 'F', 'Escorpião', 1.62, 64,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'João Pessoa'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Sophia Andrea', 'idade': 35, 'data_nasc': '23/07/1985', 'sexo': 'Feminino', 'signo': 'Leão', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,63', 'peso': 47, 'tipo_sanguineo': 'AB+', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Sophia Andrea', 35, '1985-07-23 00:00:00', 'F', 'Leão', 1.63, 47,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Manaus'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))
{'nome': 'Aurora Lúcia', 'idade': 72, 'data_nasc': '19/01/1948', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Parnaíba', 'estado': 'PI', 'altura': '1,57', 'peso': 73, 'tipo_sanguineo': 'A-', 'cor': 'amarelo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Aurora Lúcia', 72, '1948-01-19 00:00:00', 'F', 'Capricórnio', 1.57, 73,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Parnaíba'),                (SELECT id_cor FROM tb_cor WHERE cor = 'amarelo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Bruna Teresinha', 'idade': 42, 'data_nasc': '25/04/1978', 'sexo': 'Feminino', 'signo': 'Touro', 'cidade': 'Brusque', 'estado': 'SC', 'altura': '1,70', 'peso': 77, 'tipo_sanguineo': 'A-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Bruna Teresinha', 42, '1978-04-25 00:00:00', 'F', 'Touro', 1.7, 77,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Brusque'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Erick Victor', 'idade': 52, 'data_nasc': '08/10', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Salvador', 'estado': 'BA', 'altura': '1,68', 'peso': 104, 'tipo_sanguineo': 'B-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Erick Victor', 52, '1968-10-08 00:00:00', 'M', 'Libra', 1.68, 104,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Salvador'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Gabrielly Stella', 'idade': 39, 'data_nasc': '16/10/1981', 'sexo': 'Feminino', 'signo': 'Libra', 'cidade': 'Campo Grande', 'estado': 'MS', 'altura': '1,77', 'peso': 70, 'tipo_sanguineo': 'A-', 'cor': 'amarelo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Gabrielly Stella', 39, '1981-10-16 00:00:00', 'F', 'Libra', 1.77, 70,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Campo Grande'),                (SELECT id_cor FROM tb_cor WHERE cor = 'amarelo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A-'))
{'nome': 'Osvaldo Vitor', 'idade': 46, 'data_nasc': '06/05/1974', 'sexo': 'Masculino', 'signo': 'Touro', 'cidade': 'Manaus', 'estado': 'AM', 'altura': '1,67', 'peso': 74, 'tipo_sanguineo': 'O-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Osvaldo Vitor', 46, '1974-05-06 00:00:00', 'M', 'Touro', 1.67, 74,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Manaus'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O-'))
{'nome': 'Alana Kamilly', 'idade': 33, 'data_nasc': '12/01/1987', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Boa Vista', 'estado': 'RR', 'altura': '1,59', 'peso': 88, 'tipo_sanguineo': 'B+', 'cor': 'amarelo'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Alana Kamilly', 33, '1987-01-12 00:00:00', 'F', 'Capricórnio', 1.59, 88,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Boa Vista'),                (SELECT id_cor FROM tb_cor WHERE cor = 'amarelo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))
{'nome': 'Bryan Kaique', 'idade': 62, 'data_nasc': '19/06/1958', 'sexo': 'Masculino', 'signo': 'Gêmeos', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,62', 'peso': 110, 'tipo_sanguineo': 'B-', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Bryan Kaique', 62, '1958-06-19 00:00:00', 'M', 'Gêmeos', 1.62, 110,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Aracaju'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Benedito Renato', 'idade': 33, 'data_nasc': '08/10/1987', 'sexo': 'Masculino', 'signo': 'Libra', 'cidade': 'Rio Grande', 'estado': 'RS', 'altura': '1,88', 'peso': 81, 'tipo_sanguineo': 'B-', 'cor': 'laranja'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Benedito Renato', 33, '1987-10-08 00:00:00', 'M', 'Libra', 1.88, 81,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Rio Grande'),                (SELECT id_cor FROM tb_cor WHERE cor = 'laranja'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B-'))
{'nome': 'Kaique Isaac', 'idade': None, 'data_nasc': '16/12/1971', 'sexo': 'Masculino', 'signo': 'Sagitário', 'cidade': 'Juazeiro do Norte', 'estado': 'CE', 'altura': '1,89', 'peso': 100, 'tipo_sanguineo': 'O+', 'cor': 'preto'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Kaique Isaac', 48, '1971-12-16 00:00:00', 'M', 'Sagitário', 1.89, 100,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Juazeiro do Norte'),                (SELECT id_cor FROM tb_cor WHERE cor = 'preto'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'O+'))
{'nome': 'Luiz Benjamin', 'idade': 52, 'data_nasc': '03/07/1968', 'sexo': 'Masculino', 'signo': 'Câncer', 'cidade': 'Natal', 'estado': 'RN', 'altura': '1,84', 'peso': 77, 'tipo_sanguineo': 'AB-', 'cor': 'verde'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Luiz Benjamin', 52, '1968-07-03 00:00:00', 'M', 'Câncer', 1.84, 77,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Natal'),                (SELECT id_cor FROM tb_cor WHERE cor = 'verde'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB-'))
{'nome': 'Fábio Roberto', 'idade': 75, 'data_nasc': '24/12', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Londrina', 'estado': 'PR', 'altura': '2,00', 'peso': 56, 'tipo_sanguineo': 'A+', 'cor': 'amarelo'}
1945
1944
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Fábio Roberto', 75, '1944-12-24 00:00:00', 'M', 'Capricórnio', 2.0, 56,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Londrina'),                (SELECT id_cor FROM tb_cor WHERE cor = 'amarelo'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'A+'))

{'nome': 'Evelyn Julia', 'idade': None, 'data_nasc': '18/01/1978', 'sexo': 'Feminino', 'signo': 'Capricórnio', 'cidade': 'Aracaju', 'estado': 'SE', 'altura': '1,79', 'peso': 51, 'tipo_sanguineo': 'B+', 'cor': 'vermelho'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Evelyn Julia', 42, '1978-01-18 00:00:00', 'F', 'Capricórnio', 1.79, 51,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Aracaju'),                (SELECT id_cor FROM tb_cor WHERE cor = 'vermelho'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'B+'))
{'nome': 'Otávio Cláudio', 'idade': None, 'data_nasc': '04/01/1988', 'sexo': 'Masculino', 'signo': 'Capricórnio', 'cidade': 'Imperatriz', 'estado': 'MA', 'altura': '1,72', 'peso': 99, 'tipo_sanguineo': 'AB+', 'cor': 'azul'}
INSERT INTO tb_pessoa(nome, idade, data_nasc, sexo, signo, altura, peso, id_cidade, id_cor, id_tiposanguineo) VALUES('Otávio Cláudio', 32, '1988-01-04 00:00:00', 'M', 'Capricórnio', 1.72, 99,                (SELECT id_cidade FROM tb_cidade WHERE nome = 'Imperatriz'),                (SELECT id_cor FROM tb_cor WHERE cor = 'azul'),                (SELECT id_tiposanguineo FROM tb_tiposanguineo WHERE tipo = 'AB+'))

In [97]:
mydb.close()

## Respondendo ao Desafio

In [25]:
import mysql.connector

In [26]:
mydb = mysql.connector.connect(
    host='localhost',
    user='root',
    password='igti',
    database='db_desafio'
)

print(mydb)

mycursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000000055021F0>

In [27]:
mycursor.execute("SHOW TABLES")

for tb in mycursor:
    print(tb)

('tb_cidade',)
('tb_cor',)
('tb_estado',)
('tb_pessoa',)
('tb_tiposanguineo',)

### Pergunta 1
#### Quantas pessoas possuem idade maior ou igual a 50 anos?
##### Resposta: 30

In [4]:
mycursor.execute("select count(*) from tb_pessoa where idade >= 50")

myresult = mycursor.fetchone()

print(myresult)

(30,)

### Pergunta 2
#### Qual a média de idade das pessoas que moram em Mato Grosso?
##### Resposta: 44.6000

In [13]:
mycursor.execute("select e.sigla, avg(p.idade)\
                  from tb_pessoa p\
                  join tb_cidade c on c.id_cidade = p.id_cidade\
                  join tb_estado e on e.id_estado = c.id_estado\
                  where e.sigla = 'MT'\
                  group by e.sigla")
    
myresult = mycursor.fetchone()

print(myresult)

('MT', Decimal('44.6000'))

### Pergunta 3
#### Quantas pessoas nasceram nos anos de 1968 a 1978 (incluindo 1968 e 1978)?
##### Resposta: 14

In [14]:
mycursor.execute("select count(*) from tb_pessoa where data_nasc between '1968-01-01' and '1978-12-31'")

myresult = mycursor.fetchone()

print(myresult)

(14,)

### Pergunta 4
#### Ao executar o seguinte comando SQL no banco de dados criado, qual é o valor retornado?
##### Resposta: 4

In [19]:
mycursor.execute("select count(*) from tb_pessoa\
  inner join tb_tiposanguineo on tb_pessoa.id_tiposanguineo = tb_tiposanguineo.id_tiposanguineo\
  inner join tb_cidade on tb_pessoa.id_cidade = tb_cidade.id_cidade\
  inner join tb_estado on tb_cidade.id_estado = tb_estado.id_estado\
  where tb_tiposanguineo.tipo like 'AB-'\
   and (tb_estado.sigla = 'AP' or tb_estado.sigla = 'PE')")

myresult = mycursor.fetchone()

print(myresult)

(4,)

### Pergunta 5
#### Qual o nome da pessoa mais velha na base de dados?
##### Resposta: Thales Bento', 78, datetime.datetime(1942, 4, 18, 0, 0) => Menor data de nascimento é o mais velho

In [22]:
mycursor.execute("select p.nome, p.idade, p.data_nasc from tb_pessoa p\
                  where p.idade = (select max(x.idade) idade from tb_pessoa x)")

myresult = mycursor.fetchone()

print(myresult)

('Thales Bento', 78, datetime.datetime(1942, 4, 18, 0, 0))

### Pergunta 6
#### Qual o nome da pessoa mais nova da base de dados?
##### João Pedro', 18, datetime.datetime(2002, 5, 8, 0, 0) => Maior data de nascimento é o mais novo

In [28]:
mycursor.execute("select p.nome, p.idade, p.data_nasc from tb_pessoa p\
                  where p.idade = (select min(x.idade) idade from tb_pessoa x)")

myresult = mycursor.fetchone()

print(myresult)

('João Pedro', 18, datetime.datetime(2002, 5, 8, 0, 0))

### Fecha Conexão com o banco de dados

In [ ]:
mydb.close()